{
    "Common": {
        "login": "Login",
        "signup": "Sign up",
        "fullName": "Full Name",
        "registerAccount": "Create New Account",
        "email": "Email",
        "password": "Password",
        "cancel": "Cancel",
        "ok": "OK"
    },
    "Auth": {
        "diveIn": "Dive in...",
        "noAccount": "Don't have an account ?",
        "forgotPassword": "Forgot your password ?",
        "socialText": "Social Sign In:",
        "alreadyHaveAccount": "Already have an account ?",
        "resetPassword": "Reset Password",
        "enterAccountEmail": "Enter Your Account Email",
        "sendRecoverEmail": "Send Recovery Email"
    },
    "CautionModal": {
        "cannotComplete": "Your {{confirmationType}} cannot be completed just yet.",
        "tripSubmissionBlurb": "Trip Submission is still missing required information, please ensure that you fill out any fields highlighted in pink to sucessfully complete it.",
        "seaCreatureSubmissionBlurb": "In order to sucessfully submit your sea creature sighting, please provide a photo as well as the name of the species of sea creature in the photo as well as the date it was photographed. \n \n Note: The location will be automatically assumed to be the dive site you opened this page from.",
        "diveSiteBlurb": "Your dive site submission is still missing required information, please make changes and when the indicator to turns green your submission will be ready to submit.",
        "partnerAccountBlurb": "Your request is still missing required information, please ensure that you fill out all four fields to sucessfully complete your request.",
        "tripEditBlurb": "Trip edit request is still missing required information, please ensure that you fill out any fields highlighted in pink to sucessfully complete it."
    },
    "ConfirmSuccessModal": {
        "succesfullySubmitted": "Your {{confirmationType}} was successully submitted!",
        "allow24HoursToProcess": "Please allow up to 24 hours for it to be reviewed and approved.",
        "checkOpeningBlurb": "Check it by opening up your dive center on the map.",
        "waitTillProccessOrBeContacted": "We are reviewing your submission. Please allow up to 24 hours for it to be reviewed and approved. \n \n We may contact you if we need to confirm any discrepancies."
    },
    "Comments": {
        "hideReplies": "Hide Replies",
        "viewReplies": "Show {{ count }} Replies",
        "blowBubbles": "Blow some bubbles"
    },
    "Validators": {
        "fillAllFields": "Please fill out all fields",
        "fillEmailAndPassword": "Please fill out both email and password",
        "invalidCredentials": "The credentials you supplied are not valid",
        "passwordFormat": "Your password must be 6 characters or greater",
        "accountExistMsg": "You have already registered this account, please use the log in page"
    }
}